ProjectEnd_J/Source/app/Http/Controllers/Admin/Users/LoginController.php

    public function store(Request $request)
    {
        $request->validate([
            'email' => 'required',
            'password' => 'required',

        ]);
        $credentials = $request->only('email', 'password');

        if (Auth::attempt($credentials)) {
            $users = User::all();
            $sliders = Slider::all();
            $menus = Menu::all();
            $products  = Product::all();
---
select * from `users`
select * from `sliders`
select * from `menus`
select * from `products`