ProjectEnd_J/Source/app/Http/Controllers/Admin/Users/RegisterController.php

insert into `users` (`name`, `email`, `password`, `phone`, `avatar`, `updated_at`, `created_at`) values ('Trần Hồ Triệu', 'tranhotasddarieu20122002@gmail.com', '$2y$10$e4t5BYyD9/r.XpvOfae4QebJaJ3GsQGkdxyQwDpnMBr1HI3h5Q0w2', '0334340937', 'avatar2.png', '2024-05-16 12:42:33', '2024-05-16 12:42:33')
---
    public function register_action(Request $request)
    {
        $request->validate([
            'name' => 'required',
            'email' => 'required|email|unique:users',
            'password' => 'required|min:8',
            'confirm_password' => 'required|min:8',
            'phone' => 'required',
            'avatar' => 'required',
        ]);

        $data = $request->all();

        if ($data['password'] == $data['confirm_password']) {
            $check = User::create([
                'name' => $data['name'],
                'email' => $data['email'],
                'password' => Hash::make($data['password']),
                'phone' => $data['phone'],
                'avatar' => $data['avatar'],
            ]);