ProjectEnd_J/Source/app/Http/Services/Slider/SliderService.php

    public function get()
    {
        return Slider::orderByDesc('id')->paginate(10);
---
select count(*) as aggregate from `sliders`

    public function update($request, $slider)
    {
        try {
            $slider->fill($request->input());
            $slider->save();
---
update `sliders` set `thumb` = '/storage/uploads/2024/05/16/delorean-car-road-sunset-synthwave-scenery-digital-art-4k-wallpaper-uhdpaper.com-263@0@j.jpg', `sliders`.`updated_at` = '2024-05-16 01:37:04' where `id` = 5

    public function show()
    {
        return Slider::where('active', 1)->orderByDesc('sort_by')->get();
---
select * from `sliders` where `active` = 1 order by `sort_by` desc