ProjectEnd_J/Source/app/Http/Controllers/Admin/ListUserController.php

select * from `users` limit 2 offset 2
select count(*) as aggregate from `users`
---
    public function list_user()
    {
        if (Auth::check()) {
            $users = User::paginate(2);

select * from `users` where `users`.`id` is null limit 1
---
    public function edit_user(Request $request)
    {
        $user_id = $request->get('id');
        $user = User::find($user_id);

select * from `users` where `users`.`id` = '4' limit 1
---
    public function update_edit_user(Request $request)
    {
        $input = $request->all();
        $request->validate([
            'name' => 'required',
            'email' => 'required|email',
            'password' => 'required|min:8',
            'confirm_password' => 'required|min:8',
        ]);
        if ($request['password'] == $request['confirm_password']) {
            $user = User::find($input['id']);

select * from `users` where `users`.`id` = '2' limit 1
delete from `users` where `id` = 2
---
    public function delete_user(Request $request)
    {

        $user_id = $request->get('id');
        $user = User::find($user_id);
        if ($user) {
            $user->delete();

select * from `users` where `name` LIKE '%admin%' or `email` LIKE '%admin%' limit 10 offset 0
select count(*) as aggregate from `users` where `name` LIKE '%admin%' or `email` LIKE '%admin%'
---
    public function admin_search_user(Request $request)
    {
        $query = $request->input('result_search_user');

        $search_user = User::where(
            'name',
            'LIKE',
            "%$query%"
        )
            ->orWhere('email', 'LIKE', "%$query%")
            ->paginate(10);