ProjectEnd_J/Source/app/Http/Services/Product/ProductAdminService.php

    public function getMenu()
    {
        return Menu::where('active', 1)->get();
---
select * from `menus` where `active` = 1

    public function get()
    {
        return Product::with('menu')
            ->orderByDesc('id')->paginate(10);
---
select * from `menus` where `menus`.`id` in (1, 5)
select * from `products` order by `id` desc limit 10 offset 10
select count(*) as aggregate from `products`