ProjectEnd_J/Source/app/Http/Services/Menu/MenuService.php

    public function getParent()
    {
        return Menu::where('parent_id', 0)->get();
---
select * from `menus` where `parent_id` = 0

    public function show()
    {
        return Menu::select('name', 'id')
            ->where('parent_id', 0)
            ->orderbyDesc('id')
            ->get();
---
select `name`, `id` from `menus` where `parent_id` = 0 order by `id` desc

    public function getAll()
    {
        return Menu::orderbyDesc('id')->paginate(20);
---
select * from `menus` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `menus`

    public function create($request)
    {
        try {
            Menu::create([
                'name' => (string)$request->input('name'),
                'parent_id' => (int)$request->input('parent_id'),
                'description' => (string)$request->input('description'),
                'content' => (string)$request->input('content'),
                'active' => (string)$request->input('active'),
                'slug' => Str::slug($request->input('name'),'-'),
            ]);
---
insert into `menus` (`name`, `parent_id`, `description`, `content`, `active`, `slug`, `updated_at`, `created_at`) values ('gafg', 0, 'fasdf', '<p>fadf</p>', '1', 'gafg', '2024-05-16 03:56:24', '2024-05-16 03:56:24')

    public function getId($id)
    {
        return Menu::where('id', $id)->where('active', 1)->firstOrFail();
---
select * from `menus` where `id` = '1' and `active` = 1 limit 1

    public function getProduct($menu, $request)
    {
        $query = $menu->products()
            ->select('id', 'name', 'price', 'price_sale', 'thumb')
            ->where('active', 1);

        if ($request->input('price')) {
            $query->orderBy('price', $request->input('price'));
        }

        return $query
            ->orderByDesc('id')
            ->paginate(12)
            ->withQueryString();
---
select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `products`.`menu_id` = 1 and `products`.`menu_id` is not null and `active` = 1 order by `price` asc, `id` desc limit 12 offset 0
select count(*) as aggregate from `products` where `products`.`menu_id` = 11 and `products`.`menu_id` is not null and `active` = 1