ProjectEnd_J/Source/app/Http/Services/CartService.php

select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `active` = 1 and `id` in (2)
---
    public function getProduct()
    {
        $carts = Session::get('carts');
        if (is_null($carts)) return [];

        $productId = array_keys($carts);
        return Product::select('id', 'name', 'price', 'price_sale', 'thumb')
            ->where('active', 1)
            ->whereIn('id', $productId)
            ->get();

insert into `customers` (`name`, `phone`, `address`, `email`, `content`, `updated_at`, `created_at`) values ('dada', 'dasda', 'dasda', 'asda', 'dada', '2024-05-17 01:45:30', '2024-05-17 01:45:30')
---
    public function addCart($request)
    {
        try {
            DB::beginTransaction();

            $carts = Session::get('carts');

            if (is_null($carts))
                return false;

            $customer = Customer::create([
                'name' => $request->input('name'),
                'phone' => $request->input('phone'),
                'address' => $request->input('address'),
                'email' => $request->input('email'),
                'content' => $request->input('content')
            ]);

select `id`, `name`, `price`, `price_sale`, `thumb` from `products` where `active` = 1 and `id` in (59)
insert into `carts` (`customer_id`, `price`, `product_id`, `pty`) values (8, 24990000, 59, 2)
---
    protected function infoProductCart($carts, $customer_id)
    {
        $productId = array_keys($carts);
        $products = Product::select('id', 'name', 'price', 'price_sale', 'thumb')
            ->where('active', 1)
            ->whereIn('id', $productId)
            ->get();

        $data = [];
        foreach ($products as $product) {
            $data[] = [
                'customer_id' => $customer_id,
                'product_id' => $product->id,
                'pty'   => $carts[$product->id],
                'price' => $product->price_sale != 0 ? $product->price_sale : $product->price
            ];
        }

        return Cart::insert($data);

select * from `customers` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `customers`
---
    public function getCustomer()
    {
        return Customer::orderByDesc('id')->paginate(15);

select `id`, `name`, `thumb` from `products` where `products`.`id` in (2)
---
    public function getProductForCart($customer)
    {
        return $customer->carts()->with(['product' => function ($query) {
            $query->select('id', 'name', 'thumb');
        }])->get();